Revit 2026 API

# AdvancedTransparentTransparentDistance Property

---

The property labeled "Transparent Distance" from the "AdvancedTransparent" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TransparentDistance { get; }
```
```vb
Public Shared ReadOnly Property TransparentDistance As String
	Get
```
```cpp
public:
static property String^ TransparentDistance {
	String^ get ();
}
```
```fsharp
static member TransparentDistance : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

AdvancedTransparent Class

Autodesk.Revit.DB.Visual Namespace